; domain
(define (domain drone-dom)

    (:requirements
        :typing
    )

    (:types
        drone human box content location - object
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
    )

    (:action move
        :parameters (?d - drone ?from ?to - location)
        :precondition (and 
            (drone-at ?d ?from)
        )
        :effect (and
            (drone-at ?d ?to) 
            (not (drone-at ?d ?from))
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l6_p6_c6_g6_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 meds)
	(box-has box5 meds)
	(box-has box6 meds)
	(human-at human1 loc3)
	(human-at human2 loc4)
	(human-at human3 loc2)
	(human-at human4 loc1)
	(human-at human5 loc1)
	(human-at human6 loc3)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 food)
	(human-has human1 meds)
	(human-has human2 meds)
	(human-has human3 food)
	(human-has human4 food)
	(human-has human4 meds)
	))
)

; plan
1. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry drone1 box2)
   goals met: 1 of 7
2. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 0 of 7
3. (drop drone1 box2 food loc2 human3)
   deleted: (drone-carry drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc2) (human-has human3 food)
   goals met: 1 of 7
4. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 7
5. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry drone1 box1)
   goals met: 2 of 7
6. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 1 of 7
7. (drop drone1 box1 food loc3 human1)
   deleted: (drone-carry drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc3) (human-has human1 food)
   goals met: 2 of 7
8. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 7
9. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry drone1 box3)
   goals met: 3 of 7
10. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 2 of 7
11. (drop drone1 box3 food loc1 human4)
   deleted: (drone-carry drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc1) (human-has human4 food)
   goals met: 3 of 7
12. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 7
13. (pick-up drone1 box5 meds warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry drone1 box5)
   goals met: 4 of 7
14. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 3 of 7
15. (drop drone1 box5 meds loc3 human1)
   deleted: (drone-carry drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc3) (human-has human1 meds)
   goals met: 4 of 7
16. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 7
17. (pick-up drone1 box4 meds warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry drone1 box4)
   goals met: 5 of 7
18. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 4 of 7
19. (drop drone1 box4 meds loc1 human4)
   deleted: (drone-carry drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc1) (human-has human4 meds)
   goals met: 5 of 7
20. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 7
21. (pick-up drone1 box6 meds warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry drone1 box6)
   goals met: 6 of 7
22. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 5 of 7
23. (drop drone1 box6 meds loc4 human2)
   deleted: (drone-carry drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc4) (human-has human2 meds)
   goals met: 6 of 7
24. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 7
